from enum import Enum

class langFont:
    Font_SCStatus = ["未開賽", "上", "中", "下", "LIVE", "結束"]
    Font_BKStatus = ["未開賽", "第1節", "第2節", "第3節", "第4節", "LIVE", "中場", "暫停", "上", "下", "加時", "結束", "中斷"]
    Font_BBStatus = ["未開賽", "1上", "1下", "2上", "2下", "3上", "3下", "4上", "4下", "5上", "5下", "6上", "6下", "7上", "7下", "8上", "8下", "9上", "9下", "LIVE", "OT上", "OT下", "結束", "10上", "10下", "11上", "11下", "12上", "12下", "13>上", "13下", "14上", "14下", "15上", "15下", "16上", "16下", "17上", "17下", "18上", "18下", "19上", "19下", "20上", "20下", "21上", "21下", "22上", "22下", "23上", "23下", "24上", "24下", "25上", "25下", "26上", "26下", "27上", "27下", "28上", "28下", "29上", "29下", "30上", "30下", "31上", "31下", "32上", "32下", "33上", "33下", "34上", "34下", "35上", "35下", "36上", "36下", "37上", "37下", "38上", "38下", "39上", "39下", "40上", "40下", "41上", "41下", "42上", "42下", "43上", "43下", "44上", "44下", "45上", "45下", "46上", "46下", "47上", "47下", "48上", "48下", "49上", "49下", "50上", "50下"]
    Font_TNStatus = ["未開賽", "第1盤", "第2盤", "第3盤", "第4盤", "第5盤", "LIVE", "結束", "中斷"]
    Font_IHStatus = ["未開賽", "第1節", "第2節", "第3節", "加時", "LIVE", "中場", "結束", "中斷"]
    Font_VLStatus = ["未開賽", "第1局", "第2局", "第3局", "第4局", "第5局", "第6>局", "第7局", "LIVE", "結束", "中斷"]
    Font_BMStatus = ["未開賽", "第1局", "第2局", "第3局", "第4局", "第5局", "LIVE", "結束", "中斷"]
    Font_ESStatus = ["未開賽", "第1局", "第2局", "第3局", "第4局", "第5局", "第6>局", "第7局", "LIVE", "結束", "中斷"]
    Font_AFStatus = ["未開賽", "第1節", "第2節", "第3節", "第4節", "中場", "暫停", "上", "下", "加時", "LIVE", "結束", "中斷"]
    Font_PBStatus = ["未開賽", "LIVE"]
    Font_TTStatus = ["未開賽", "第1局", "第2局", "第3局", "第4局", "第5局", "第6>局", "第7局", "LIVE", "結束", "中斷"]
    Font_HBStatus = ["未開賽", "上", "中", "下", "加時", "LIVE", "結束", "中斷"]
    Font_WPStatus = ["未開賽", "第1節", "第2節", "第3節", "第4節", "暫停", "上", "中", "下", "加時", "LIVE", "結束", "中斷"]
    Font_OPStatus = ["未開賽", "LIVE"]
    Font_BXStatus = ["未開賽"]
    Font_RollBall = "LIVE"

class GameType(Enum):
    # baseball not used in protobuf game class
    baseball = 'baseball'
    mlb = 'mlb'    # 美棒
    npb = 'npb'    # 日棒
    cpbl = 'cpbl'  # 台棒
    kbo = 'kbo'    # 韓棒和其他
    basketball = 'basketball'  # NBA
    otherbasketball = 'otherbasketball'  # 其他非NBA籃球
    tennis = 'tennis'
    hockey = 'hockey'
    football = 'football'
    eSport = 'eSport'
    soccer = 'soccer'
    UCL = 'UCL'  # 歐洲冠軍足球
    wsc = "wsc"
    pingpong = 'PP'
    volleyball = 'VL'
    other = 'other'

class Mapping:
    sport_type = {
        "soccer" : {"early":[1,2,3,4,5,6], "today":[1,2,3,4,5,6], "live":[1,2,4,5,6,7]},
        "basketball" : {"early":[1,2,3,4], "today":[1,2,3,4], "live":[1,5,6,7]},
        "baseball" : {"early":[1,2,3,4,5], "today":[1,2,3,4,5], "live":[6,7,8,9,10]},
        "tennis" : {"early":[1,2], "today":[1,2], "live":[3,4,5]},
        "hockey" : {"early":[1,2,3], "today":[1,2,3], "live":[3,4]},
        "volleyball" : {"early":[1,2], "today":[1,2], "live":[3,4,5]},
        "badminton" : {"early":[1,2], "today":[1,2], "live":[3,4,5]},
        "eSport" : {"early":[1,2,3], "today":[1,2,3], "live":[4]}, 
        "football" : {"early":[], "today":[], "live":[]},
        "billiardball" : {"early":[1,2], "today":[1,2], "live":[3,4,5]},
        "PP" : {"early":[1,2], "today":[1,2], "live":[3,4,5]},
        "UCL" : {"early":[], "today":[], "live":[]},
        "wsc" : {"early":[], "today":[], "live":[]},
        "coming soon" : {"early":[], "today":[], "live":[]}
    }

    # 足球 ["11003","","","0701","07",1,0,0,"0",1,120000,120000,"1",3.030,"2",0.929,"3",2.272]
    # 籃球 ["12001","","","0701","07",1,0,0,"19500",0,6000,12000,"1",0.900,"2",0.900]
    class oddsData:
        oddType = 0             # 賠率類別
        # None = 1              # 未使用 - 意義不明
        # None = 2              # 未使用 - 意義不明
        oddGroup = 3            # 賠率組別
        # None = 4              # 未使用 - 意義不明
        # None = 5              # 未使用 - 意義不明
        # None = 6              # 未使用 - 意義不明
        # None = 7              # 未使用 - 意義不明
        oddLine = 8             # 球頭
        whichTeam = 9           # 讓隊 (1: 主讓 , 0: 客讓)
        # None = 10             # 未使用 - 意義不明
        # None = 11             # 未使用 - 意義不明
        homeOdd = 13            # 主隊賠率
        awayOdd = 15            # 客隊賠率
        drawOdd = 17            # 和賠率
        tg_0_1 = 13             # 入球數 0-1
        tg_2_3 = 15             # 入球數 2-3
        tg_4_6 = 17             # 入球數 4-6
        tg_7 = 19               # 入球數 7+
        ## Raw data key [ 11 : HH, 12 : HA, 13: HD, 21 : AH, 22 : AA, 23 : AD, 31 : DH, 32 : DA, 33 : DD ]
        ## Raw data value [ HH : 13, HA : 15, HD : 17, AH : 19, AA : 21, AD : 23, DH : 25, DA : 27, DD : 29 ]
        hf_HH = 13              # 半全場 HH
        hf_HA = 15              # 半全場 HA
        hf_HD = 17              # 半全場 HD
        hf_AH = 19              # 半全場 AH
        hf_AA = 21              # 半全場 AA
        hf_AD = 23              # 半全場 AD
        hf_DH = 25              # 半全場 DH
        hf_DA = 27              # 半全場 DA
        hf_DD = 29              # 半全場 DD            

    # 足球 ["111610718","11_2264_0_1",["聖帕特里克"],["沙姆洛克流浪"],"","",[""],[""],1,"2022/06/28 02:45","","0","34006409C","",1,1,"2022/06/28","5DF02DAC35ADD2F4",0,"45",1]
    # 籃球 ["122301832","12_4250_0_2",["水原大學-女"],["釜山大學-女"],"","",[""],[""],1,"2022/06/27 13:00","","6","","3",0,1,"2022/06/28","D14088BCF49AF575",0,"",1]
    class gameData:
        gameId = 0              # 遊戲編號
        gameLeagueId = 1        # 遊戲對應的聯盟編號
        homeName = 2            # 主隊名稱
        awayName = 3            # 客隊名稱
        # None = 4              # 未使用 - 意義不明
        # None = 5              # 未使用 - 意義不明
        homeCountry = 6         # 未使用 - 主隊國家
        awayCountry = 7         # 未使用 - 客隊國家
        # None = 8              # 未使用 - 意義不明
        startTime = 9           # 開賽時間
        runningTime = 10        # 比賽時間
        runningType = 11        # 比賽狀態 (ex.上半場、第一局....)
        # None = 12             # 未使用 - 意義不明
        live = 13               # 未使用 - 是否為滾球(走地) (空值 為 否) 
        # None = 14             # 未使用 - 意義不明
        # None = 15             # 未使用 - 意義不明
        # None = 16             # 未使用 - 日期
        gamePid = 17            # 未使用 - 遊戲代號
        # None = 18             # 未使用 - 意義不明
        ht = 19                 # 判斷比賽時間 + or '
        # None = 20             # 未使用 - 意義不明

    # 足球 ["11_2264_0_1","愛爾蘭超級聯賽",4009000,11,11]
    # 籃球 ["12_8189_0_2","籃球超級聯賽",10813000,12,12]
    class allyData:
        leagueId = 0            # 聯盟編號
        leagueName = 1          # 聯盟名稱
        leagueUUID = 2          # 未使用 - 意義不明
        sportId = 3             # 運動編號
        typeId = 4              # 運動類型

    # 足球 "112611148":["3","1","","",[],[],0,0,["0","0","0","0","0","0"],["0","0","0","0","0","0"],0,16,"3","1"]
    # 籃球 "142127890": ["0", "0", "", "", ["3", "", "", "", ""], ["1", "", "", "", ""], "40", "15", [], [], 2, 3, "0", "0"]
    class scoreData:
        homeScore = 0           # 主隊比分
        awayScore = 1           # 客隊比分
        homeRedcard = 2         # 主隊紅牌
        awayRedcard = 3         # 客隊紅牌
        # homeRoundScore = 4    # 主隊各局數分數 
        # awayRoundScore = 5    # 客隊各局數分數 
        # None = 6              # 未使用 - 意義不明
        # None = 7              # 未使用 - 意義不明
        # homeRoundScore = 8    # 主隊各局數分數
        # awayRoundScore = 9    # 客隊各局數分數
        # None = 10             # 未使用 - 意義不明
        # None = 11             # 未使用 - 意義不明
        # homeScore = 12        # 主隊比分 - 與 '0' 相同，實際使用'0'
        # awayScore = 13        # 客隊比分 - 與 '1' 相同，實際使用'1'
